OpenFOAM/FE41/tutorials/deformableCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        nFaces          50;
        startFace       4900;
    }
    left
    {
        type            wall;
        nFaces          50;
        startFace       4950;
    }
    bottom
    {
        type            wall;
        nFaces          50;
        startFace       5000;
    }
    right
    {
        type            wall;
        nFaces          50;
        startFace       5050;
    }
    frontAndBack
    {
        type            empty;
        nFaces          5000;
        startFace       5100;
    }
)


// ************************************************************************* //
