OpenFOAM/FE41/tutorials/deformableCavity/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dynamicFvMesh staticFvMesh;

dynamicFvMesh dynamicBodyFvMesh;

dynamicBodyFvMeshCoeffs
{
    bodyPatchName left;
    translationDirection (1 0 0);
    translationAmplitude 0.05;
    translationFrequency 10;
    initialRotationOrigin (0 0 0);
    rotationAxis (0 0 1);
    rotationAmplitude 0;
    rotationFrequency 0;
}

solver laplace;

diffusivity uniform;

frozenDiffusion off;

distancePatches
(
    left
    right
);


// ************************************************************************* //
