OpenFOAM/FE41/tutorials/deformableCavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type slip;
        value $internalField;
    }

    left
    {
        type movingWallVelocity;
        value $internalField;
    }

    bottom
    {
        type slip;
        value $internalField;
    }

    right
    {
        type slip;
        value $internalField;
    }
    
    frontAndBack
    {
        type empty;
    }
}


// ************************************************************************* //
