OpenFOAM/FE41/tutorials/deformableCavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    top
    {
        type zeroGradient;
        valu $internalField;
    }

    left
    {
        type zeroGradient;
        valu $internalField;
    }

    bottom
    {
        type zeroGradient;
        valu $internalField;
    }

    right
    {
        type zeroGradient;
        valu $internalField;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
